### Necessary stuff

brew "git"

# GPG for signing git commits
brew "gnupg"
brew "pinentry-mac"

### Languages

brew "elixir"
brew "erlang"

brew "node"

### CLI Improvements

# Terminal fuzzy finder.
# Used a lot by other scripts and tools.
brew "fzf"

# Command line json parser
brew "jq"

# Fast recursive file grep
# Used by a lot of other scripts and tools
brew "ripgrep"

### CLI Tools

# Terminal multiplexer
brew "tmux"

# Neovim editor
brew "neovim"

# Github CLI tool
brew "gh"

# Claude Code CLI
cask "claude-code"

### Applications

cask "obsidian"

cask "wezterm"

cask "tailscale-app"

### Dependencies

# Nerdfront used in most places
cask "font-source-code-pro"
