### Necessary stuff

brew "git"
brew "stow"

# GPG for signing git commits
brew "gnupg"
brew "pinentry-mac"

### Languages

brew "elixir"
brew "erlang"

brew "node"

### CLI Improvements

# Better "ls" bound to "lz"
brew "eza"

# Better "cd" bound to "zd"
brew "zoxide"

# Terminal fuzzy finder.
# Used a lot by other scripts and tools.
brew "fzf"

# Command line json parser
brew "jq"

# Fast recursive file grep
# Used by a lot of other scripts and tools
brew "ripgrep"

### Zsh

# Prompt theme
brew "powerlevel10k"

# Command suggestions
brew "zsh-autosuggestions"

# Highlights command as red/green if invalid/valid
brew "zsh-syntax-highlighting"

### CLI Tools

# Terminal multiplexer
brew "tmux"

# Neovim editor
brew "neovim"

# Github CLI tool
brew "gh"

### Applications

cask "obsidian"

cask "wezterm"

cask "tailscale-app"

### Dependencies

# Nerdfront used in most places
cask "font-source-code-pro"
